// --------------------------------1--------------------------------
// const users = ['Mango', 'Poly', 'Ajax', 'Chelsey'];

// console.log(users.length);

// console.log(users[0]); 
// console.log(users[1]); 
// console.log(users[2]); 
// console.log(users[3]); 
// --------------------------------1--------------------------------

// --------------------------------2--------------------------------

// const users = ["Mango", "Poly", "Ajax", "Chelsey"];

// /* Используя методы массива, последовательно выполнить следующие операции */

// // Удалить из начала массива нулевой элемент

// console.log(users.shift());

// // Удалить из конца массив последний элемент
// console.log(users.pop()); 
// users.unshift ("добавленое имя");
// // Добавить в начало массива любое имя
// console.log(users);
// // Добавить в конец массива два любых имени за одну операцию
// users.splice(3, 0, "имя 1", "имя 2")
// console.log(users);

// --------------------------------2--------------------------------

// --------------------------------3--------------------------------

let string;

do {
    string = prompt('Введите произвольное число');
} while (string === null);



// --------------------------------3--------------------------------

// --------------------------------4--------------------------------

// let counter = 0;

// while (counter < 10) {
//   console.log("counter: ", counter);

//   counter += 1;
// }


// let input = 0;

// do {
//   input = Number (prompt('Введите число больше 100', ''));
//   console.log(input);
  
// } while(input <= 100 || input === null);

// --------------------------------4--------------------------------



